fio/fio_disk/disk_bare/log/RAID0/log_39/sdf/fio_randwrite_04k.log
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
fio-3.1
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=15272: Mon Jul 23 18:36:11 2018
  write: IOPS=456, BW=1826KiB/s (1870kB/s)(1024MiB/574253msec)
    slat (nsec): min=2824, max=71313, avg=18718.97, stdev=7383.19
    clat (usec): min=273, max=821102, avg=140173.78, stdev=54364.60
     lat (usec): min=295, max=821130, avg=140192.95, stdev=54364.66
    clat percentiles (msec):
     |  1.00th=[   62],  5.00th=[   74], 10.00th=[   84], 20.00th=[   97],
     | 30.00th=[  110], 40.00th=[  122], 50.00th=[  134], 60.00th=[  146],
     | 70.00th=[  161], 80.00th=[  176], 90.00th=[  197], 95.00th=[  218],
     | 99.00th=[  338], 99.50th=[  409], 99.90th=[  567], 99.95th=[  634],
     | 99.99th=[  743]
   bw (  KiB/s): min=  368, max= 2760, per=100.00%, avg=1825.52, stdev=154.85, samples=1148
   iops        : min=   92, max=  690, avg=456.38, stdev=38.71, samples=1148
  lat (usec)   : 500=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.05%, 50=0.14%
  lat (msec)   : 100=22.34%, 250=74.93%, 500=2.34%, 750=0.18%, 1000=0.01%
  cpu          : usr=0.53%, sys=1.39%, ctx=262143, majf=0, minf=303
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwt: total=0,262144,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=1826KiB/s (1870kB/s), 1826KiB/s-1826KiB/s (1870kB/s-1870kB/s), io=1024MiB (1074MB), run=574253-574253msec

Disk stats (read/write):
  sdf: ios=40/262017, merge=0/0, ticks=6/36730426, in_queue=36735268, util=100.00%